#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.policy.aws_iam_role.add_user_to_customer_group_lambda_exec_role: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role]
module.policy.aws_iam_role.glue_trigger_lambda_exec_role: Refreshing state... [id=demo_glue_trigger_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_revenue_sum_by_cohort_function_object: Refreshing state... [id=lambdas/demo/get_revenue_sum_by_cohort_handler.zip]
module.policy.aws_iam_role.get_universe_overview_lambda_exec_role: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_cohort_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_cohort_scenarios_lambda_function]
module.policy.aws_iam_role.get_revenue_sum_by_cohort_lambda_exec_role: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.add_user_to_customer_group_lambda_function: Refreshing state... [id=/aws/lambda/demo_add_user_to_customer_group_lambda_function]
module.policy.aws_iam_role.get_cohort_scenarios_lambda_exec_role: Refreshing state... [id=demo_get_cohort_scenarios_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_roles_function_object: Refreshing state... [id=lambdas/demo/get_roles_handler.zip]
module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object: Refreshing state... [id=lambdas/demo/get_comparison_vs_peers_handler.zip]
module.buckets.aws_s3_bucket_object.layer_libraries_object: Refreshing state... [id=layer/demo/layer_libraries.zip]
module.buckets.aws_s3_bucket_object.get_users_function_object: Refreshing state... [id=lambdas/demo/get_users_handler.zip]
module.buckets.aws_s3_bucket_object.get_company_scenarios_function_object: Refreshing state... [id=lambdas/demo/get_company_scenarios_handler.zip]
module.buckets.aws_s3_bucket_object.get_metrics_function_object: Refreshing state... [id=lambdas/demo/get_metrics_handler.zip]
module.buckets.aws_s3_bucket_object.get_metrics_by_cohort_id_function_object: Refreshing state... [id=lambdas/demo/get_metrics_by_cohort_id_handler.zip]
module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object: Refreshing state... [id=lambdas/demo/get_company_report_vs_peers_handler.zip]
module.policy.aws_iam_role.assign_company_permissions_lambda_exec_role: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role]
module.policy.aws_iam_role.get_company_permissions_lambda_exec_role: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role]
module.policy.aws_iam_role.get_company_scenarios_lambda_exec_role: Refreshing state... [id=demo_get_company_scenarios_lambda_exec_role]
module.policy.aws_iam_role.get_cohort_by_id_lambda_exec_role: Refreshing state... [id=demo_get_cohort_by_id_lambda_exec_role]
module.policy.aws_iam_role.get_users_lambda_exec_role: Refreshing state... [id=demo_get_users_lambda_exec_role]
module.policy.aws_iam_role.get_company_report_vs_peers_lambda_exec_role: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role]
module.policy.aws_iam_role.list_scenarios_lambda_exec_role: Refreshing state... [id=demo_list_scenarios_lambda_exec_role]
module.policy.aws_iam_role.companies_lambda_exec_role: Refreshing state... [id=demo_companies_lambda_exec_role]
module.policy.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_logging_function_back]
module.policy.aws_iam_role.verify_users_with_same_email_lambda_exec_role: Refreshing state... [id=demo_verify_users_with_same_email_exec_role]
module.logs.aws_cloudwatch_log_group.get_user_details_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_user_details_lambda_function]
module.logs.aws_cloudwatch_log_group.get_comparison_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_comparison_vs_peers_lambda_function]
module.logs.aws_cloudwatch_log_group.get_average_metrics_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_average_metrics_lambda_function]
module.logs.aws_cloudwatch_log_group.change_company_publicly_lambda_function: Refreshing state... [id=/aws/lambda/demo_change_company_publicly_lambda_function]
module.logs.aws_cloudwatch_log_group.list_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_list_scenarios_lambda_function]
module.logs.aws_cloudwatch_log_group.verify_users_with_same_email_lambda_function: Refreshing state... [id=/aws/lambda/demo_verify_users_with_same_email_lambda_function]
module.logs.aws_cloudwatch_log_group.get_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_scenarios_lambda_function]
module.logs.aws_cloudwatch_log_group.get_roles_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_roles_lambda_function]
module.logs.aws_cloudwatch_log_group.get_all_companies_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_all_companies_lambda_function]
module.logs.aws_cloudwatch_log_group.get_metrics_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metrics_lambda_function]
module.logs.aws_cloudwatch_log_group.get_users_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_users_lambda_function]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=kb7gblbu69]
module.buckets.aws_s3_bucket_object.get_cohort_by_id_function_object: Refreshing state... [id=lambdas/demo/get_cohort_by_id_handler.zip]
module.buckets.aws_s3_bucket_object.get_average_metrics_function_object: Refreshing state... [id=lambdas/demo/get_average_metrics_handler.zip]
module.buckets.aws_s3_bucket_object.get_universe_overview_function_object: Refreshing state... [id=lambdas/demo/get_universe_overview_handler.zip]
module.buckets.aws_s3_bucket_object.get_metric_by_company_id_function_object: Refreshing state... [id=lambdas/demo/get_metric_by_company_id_handler.zip]
module.logs.aws_cloudwatch_log_group.glue_trigger_lambda_function: Refreshing state... [id=/aws/lambda/demo_glue_trigger_lambda_function]
module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object: Refreshing state... [id=lambdas/demo/add_user_to_customer_group_handler.zip]
module.buckets.aws_s3_bucket_object.get_scenarios_function_object: Refreshing state... [id=lambdas/demo/get_scenarios_handler.zip]
module.buckets.aws_s3_bucket_object.get_all_companies_function_object: Refreshing state... [id=lambdas/demo/get_all_companies_handler.zip]
module.buckets.aws_s3_bucket_object.authorize_function_object: Refreshing state... [id=lambdas/demo/authorize_handler.zip]
module.buckets.aws_s3_bucket_object.get_revenue_sum_by_company_function_object: Refreshing state... [id=lambdas/demo/get_revenue_sum_by_company_handler.zip]
module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object: Refreshing state... [id=lambdas/demo/assign_company_permissions_handler.zip]
module.policy.aws_iam_role.get_comparison_vs_peers_lambda_exec_role: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_cohort_scenarios_function_object: Refreshing state... [id=lambdas/demo/get_cohort_scenarios_handler.zip]
module.policy.aws_iam_role.get_average_metrics_lambda_exec_role: Refreshing state... [id=demo_get_average_metrics_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_average_metrics_by_cohort_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_average_metrics_by_cohort_lambda_function]
module.policy.aws_iam_role.get_roles_lambda_exec_role: Refreshing state... [id=demo_get_roles_lambda_exec_role]
module.policy.aws_iam_role.authorize_lambda_invoke_role: Refreshing state... [id=demo_authorize_lambda_invoke_role]
module.buckets.aws_s3_bucket_object.get_average_metrics_by_cohort_function_object: Refreshing state... [id=lambdas/demo/get_average_metrics_by_cohort_handler.zip]
module.policy.aws_iam_role.get_cohorts_lambda_exec_role: Refreshing state... [id=demo_get_cohorts_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_company_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_lambda_function]
module.policy.aws_iam_role.get_metrics_lambda_exec_role: Refreshing state... [id=demo_get_metrics_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_company_permissions_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_permissions_lambda_function]
module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object: Refreshing state... [id=lambdas/demo/verify_users_with_same_email_handler.zip]
module.logs.aws_cloudwatch_log_group.authorize_lambda_function: Refreshing state... [id=/aws/lambda/demo_authorize_lambda_function]
module.logs.aws_cloudwatch_log_group.get_metric_by_id_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metric_by_company_id_lambda_function]
module.logs.aws_cloudwatch_log_group.get_cohort_by_id_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_cohort_by_id_lambda_function]
module.logs.aws_cloudwatch_log_group.get_metrics_by_cohort_id_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_metrics_by_cohort_id_lambda_function]
module.buckets.aws_s3_bucket_object.get_cohorts_function_object: Refreshing state... [id=lambdas/demo/get_cohorts_handler.zip]
module.logs.aws_cloudwatch_log_group.get_cohorts_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_cohorts_lambda_function]
module.buckets.aws_s3_bucket_object.glue_trigger_function_object: Refreshing state... [id=lambdas/demo/glue_trigger_handler.zip]
module.policy.aws_iam_role.get_average_metrics_by_cohort_lambda_exec_role: Refreshing state... [id=demo_get_average_metrics_by_cohort_lambda_exec_role]
module.buckets.aws_s3_bucket_object.list_scenarios_function_object: Refreshing state... [id=lambdas/demo/list_scenarios_handler.zip]
module.buckets.aws_s3_bucket_object.get_user_details_function_object: Refreshing state... [id=lambdas/demo/get_user_details_handler.zip]
module.logs.aws_cloudwatch_log_group.get_revenue_sum_by_company_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_revenue_sum_by_company_lambda_function]
module.policy.aws_iam_role.get_scenarios_lambda_exec_role: Refreshing state... [id=demo_get_scenarios_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_company_permissions_function_object: Refreshing state... [id=lambdas/demo/get_company_permissions_handler.zip]
module.policy.aws_iam_role.get_user_details_lambda_exec_role: Refreshing state... [id=demo_get_user_details_lambda_exec_role]
module.policy.aws_iam_policy.lambda_glue_access: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_iam_policy_lambda_glue_access]
module.logs.aws_cloudwatch_log_group.get_company_report_vs_peers_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_report_vs_peers_lambda_function]
module.logs.aws_cloudwatch_log_group.get_company_scenarios_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_company_scenarios_lambda_function]
module.policy.aws_iam_role.change_company_publicly_lambda_exec_role: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role]
module.buckets.aws_s3_bucket_object.change_company_publicly_function_object: Refreshing state... [id=lambdas/demo/change_company_publicly_handler.zip]
module.policy.aws_iam_role.authorize_lambda_exec_role: Refreshing state... [id=demo_authorize_lambda_exec_role]
module.policy.aws_iam_role.get_metric_by_company_id_lambda_exec_role: Refreshing state... [id=demo_get_metric_by_company_id_lambda_exec_role]
module.logs.aws_cloudwatch_log_group.get_universe_overview_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_universe_overview_lambda_function]
module.policy.aws_iam_role.get_metrics_by_cohort_id_lambda_exec_role: Refreshing state... [id=demo_get_metrics_by_cohort_id_lambda_exec_role]
aws_route53_zone.kpinetwork: Refreshing state... [id=Z02521762FZPW0IDM8JJO]
module.logs.aws_cloudwatch_log_group.codebuild_rds_migrations: Refreshing state... [id=/aws/codebuild/demo_rds_migrations]
module.policy.aws_lambda_permission.apigw_authorize_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_iam_role.get_revenue_sum_by_company_lambda_exec_role: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_exec_role]
module.codebuild.aws_codebuild_source_credential.git_credential: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:token/github]
module.logs.aws_cloudwatch_log_group.assign_company_permissions_lambda_function: Refreshing state... [id=/aws/lambda/demo_assign_company_permissions_lambda_function]
module.buckets.aws_s3_bucket_object.etl_script_object: Refreshing state... [id=pyspark/kpinetwork_analizer.py]
module.logs.aws_cloudwatch_log_group.get_revenue_sum_by_cohort_lambda_function: Refreshing state... [id=/aws/lambda/demo_get_revenue_sum_by_cohort_lambda_function]
module.policy.aws_iam_role.company_lambda_exec_role: Refreshing state... [id=demo_company_lambda_exec_role]
module.buckets.aws_s3_bucket_object.get_company_function_object: Refreshing state... [id=lambdas/demo/get_company_handler.zip]
module.cert.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:435552912911:certificate/2e6953ea-c466-4ff3-baa9-7e8c3440affa]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_logs: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916088000000002]
module.network.aws_api_gateway_resource.roles: Refreshing state... [id=7w2rqf]
module.network.aws_api_gateway_resource.company_report_vs_peers: Refreshing state... [id=mlpebw]
module.network.aws_api_gateway_resource.users: Refreshing state... [id=837cdz]
module.network.aws_api_gateway_resource.cohorts: Refreshing state... [id=97prpe]
module.network.aws_api_gateway_resource.companies: Refreshing state... [id=bnvar7]
module.network.aws_api_gateway_resource.universe_overview: Refreshing state... [id=zr5b6w]
module.network.aws_api_gateway_resource.scenarios: Refreshing state... [id=ifcpo2]
module.network.aws_api_gateway_resource.metrics: Refreshing state... [id=1cyyi4]
module.network.aws_api_gateway_resource.comparison_vs_peers: Refreshing state... [id=ygo84c]
module.policy.aws_iam_role_policy.authorize_lambda_invoke_policy: Refreshing state... [id=demo_authorize_lambda_invoke_role:demo_authorize_lambda_invoke_policy]
module.policy.aws_iam_role_policy_attachment.glue_trigger_lambda_glue_access: Refreshing state... [id=demo_glue_trigger_lambda_exec_role-20211108151916085000000001]
module.policy.aws_iam_role_policy_attachment.get_cohort_scenarios_lambda_logs: Refreshing state... [id=demo_get_cohort_scenarios_lambda_exec_role-20211116152817268600000004]
module.policy.aws_iam_role_policy_attachment.get_metric_by_company_id_lambda_logs: Refreshing state... [id=demo_get_metric_by_company_id_lambda_exec_role-20211110195232357400000002]
module.policy.aws_iam_role_policy_attachment.authorize_lambda_logs: Refreshing state... [id=demo_authorize_lambda_exec_role-20220113125137753300000001]
module.policy.aws_iam_role_policy_attachment.scenarios_lambda_logs: Refreshing state... [id=demo_get_scenarios_lambda_exec_role-20211125180844569300000001]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_by_cohort_lambda_logs: Refreshing state... [id=demo_get_average_metrics_by_cohort_lambda_exec_role-20211125134234098900000002]
module.policy.aws_iam_role_policy_attachment.get_roles_lambda_logs: Refreshing state... [id=demo_get_roles_lambda_exec_role-20220201183736169200000001]
module.policy.aws_iam_role_policy_attachment.get_comparison_vs_peers_lambda_logs: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role-20211222131917584000000001]
module.policy.aws_iam_role_policy_attachment.add_user_to_customer_group_lambda_logs: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role-20220105181813257800000001]
module.policy.aws_iam_role_policy_attachment.list_scenarios_lambda_logs: Refreshing state... [id=demo_list_scenarios_lambda_exec_role-20211111170237751100000001]
module.policy.aws_iam_role_policy_attachment.get_cohorts_lambda_logs: Refreshing state... [id=demo_get_cohorts_lambda_exec_role-20211116152816576300000002]
module.policy.aws_iam_role_policy_attachment.get_users_lambda_logs: Refreshing state... [id=demo_get_users_lambda_exec_role-20220129002343661500000002]
module.policy.aws_iam_role_policy_attachment.change_company_publicly_lambda_logs: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role-20220215163304155600000001]
module.policy.aws_iam_role_policy_attachment.get_metrics_lambda_logs: Refreshing state... [id=demo_get_metrics_lambda_exec_role-20211110194402226000000002]
module.policy.aws_iam_role_policy_attachment.assign_company_permissions_lambda_logs: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role-20220214140917367200000002]
module.policy.aws_iam_role_policy_attachment.companies_lambda_logs: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145749002900000004]
module.policy.aws_iam_role_policy_attachment.get_company_permissions_lambda_logs: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role-20220216143113047800000002]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_lambda_logs: Refreshing state... [id=demo_get_average_metrics_lambda_exec_role-20211122220041624400000004]
module.policy.aws_iam_role_policy_attachment.verify_users_with_same_email_lambda_logs: Refreshing state... [id=demo_verify_users_with_same_email_exec_role-20220127183123476100000001]
module.policy.aws_iam_role_policy_attachment.get_company_report_vs_peers_lambda_logs: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role-20211217193844110800000001]
module.policy.aws_iam_role_policy_attachment.company_scenarios_lambda_logs: Refreshing state... [id=demo_get_company_scenarios_lambda_exec_role-20211111170238921300000003]
module.policy.aws_iam_role_policy_attachment.get_cohort_by_id_lambda_logs: Refreshing state... [id=demo_get_cohort_by_id_lambda_exec_role-20211116152817488400000005]
module.policy.aws_iam_role_policy_attachment.get_universe_overview_lambda_logs: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20211209154733547100000001]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_cohort_lambda_logs: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_exec_role-20211122220041296600000001]
module.sql.aws_db_subnet_group.kpinetwork: Refreshing state... [id=demokpinetwork]
module.policy.aws_iam_role_policy_attachment.get_users_lambda_vpc: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20220129002338871000000001]
module.policy.aws_iam_role_policy_attachment.scenarios_lambda_vpc: Refreshing state... [id=demo_get_scenarios_lambda_exec_role-20211125180844570400000002]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_by_cohort_lambda_vpc: Refreshing state... [id=demo_get_average_metrics_by_cohort_lambda_exec_role-20211125134234099900000003]
module.policy.aws_iam_role_policy_attachment.get_universe_overview_lambda_vpc: Refreshing state... [id=demo_get_universe_overview_lambda_exec_role-20211209154733547200000002]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_cohort_lambda_vpc: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_exec_role-20211122220041371600000002]
module.policy.aws_iam_role_policy_attachment.get_cohort_scenarios_lambda_vpc: Refreshing state... [id=demo_get_cohort_scenarios_lambda_exec_role-20211116152817033600000003]
module.policy.aws_iam_role_policy_attachment.get_cohorts_lambda_vpc: Refreshing state... [id=demo_get_cohorts_lambda_exec_role-20211116152816484600000001]
module.policy.aws_iam_role_policy_attachment.get_metric_by_id_lambda_vpc: Refreshing state... [id=demo_get_metric_by_company_id_lambda_exec_role-20211110195232341900000001]
module.policy.aws_iam_role_policy_attachment.get_average_metrics_lambda_vpc: Refreshing state... [id=demo_get_average_metrics_lambda_exec_role-20211122220041443600000003]
module.policy.aws_iam_role_policy_attachment.company_scenarios_lambda_vpc: Refreshing state... [id=demo_get_company_scenarios_lambda_exec_role-20211111170238922300000004]
module.policy.aws_iam_role_policy_attachment.get_comparison_vs_peers_lambda_vpc: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_exec_role-20211222131917590600000002]
module.policy.aws_iam_role_policy_attachment.change_company_publicly_lambda_vpc: Refreshing state... [id=demo_change_company_publicly_lambda_exec_role-20220215163304159600000002]
module.policy.aws_iam_role_policy_attachment.get_company_permissions_lambda_vpc: Refreshing state... [id=demo_get_company_permissions_lambda_exec_role-20220216143113048700000003]
module.policy.aws_iam_role_policy_attachment.list_scenarios_lambda_vpc: Refreshing state... [id=demo_list_scenarios_lambda_exec_role-20211111170238199900000002]
module.policy.aws_iam_role_policy_attachment.get_metrics_lambda_vpc: Refreshing state... [id=demo_get_metrics_lambda_exec_role-20211110194402192800000001]
module.policy.aws_iam_role_policy_attachment.companies_lambda_vpc: Refreshing state... [id=demo_companies_lambda_exec_role-20211104145748993600000001]
module.policy.aws_iam_role_policy_attachment.get_company_report_vs_peers_lambda_vpc: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_exec_role-20211217193844121400000002]
module.policy.aws_iam_role_policy_attachment.get_cohort_by_id_lambda_vpc: Refreshing state... [id=demo_get_cohort_by_id_lambda_exec_role-20211116152817567900000006]
module.policy.aws_iam_role_policy_attachment.assign_company_permissions_lambda_vpc: Refreshing state... [id=demo_assign_company_permissions_lambda_exec_role-20220214140917365700000001]
module.policy.aws_iam_role_policy_attachment.get_metrics_by_cohort_id_lambda_vpc: Refreshing state... [id=demo_get_metrics_by_cohort_id_lambda_exec_role-20211125134234097000000001]
module.policy.aws_iam_role_policy_attachment.get_metrics_by_cohort_id_lambda_logs: Refreshing state... [id=demo_get_metrics_by_cohort_id_lambda_exec_role-20211125134234575000000004]
module.policy.aws_iam_role_policy_attachment.get_user_details_lambda_vpc: Refreshing state... [id=demo_get_user_details_lambda_exec_role-20220216143110620800000001]
module.policy.aws_iam_role_policy_attachment.get_user_details_lambda_logs: Refreshing state... [id=demo_get_user_details_lambda_exec_role-20220204083752775200000001]
module.network.aws_api_gateway_resource.company_report_vs_peers_id: Refreshing state... [id=wycmf0]
module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment: Refreshing state... [id=vdz4b2]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_company_lambda_logs: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_exec_role-20211115215557782400000002]
module.policy.aws_iam_role_policy_attachment.get_revenue_sum_by_company_lambda_vpc: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_exec_role-20211115215557782000000001]
module.network.aws_api_gateway_resource.user: Refreshing state... [id=zhsk31]
module.network.aws_api_gateway_resource.cohort: Refreshing state... [id=5k8zew]
module.network.aws_api_gateway_resource.cohort_revenue: Refreshing state... [id=pymy9y]
module.network.aws_api_gateway_resource.company: Refreshing state... [id=sjvaet]
module.network.aws_api_gateway_resource.change_company_publicly: Refreshing state... [id=eeb9pt]
module.network.aws_api_gateway_resource.company_revenue: Refreshing state... [id=cl0jnm]
module.network.aws_api_gateway_resource.scenario_company: Refreshing state... [id=z01lfb]
module.network.aws_api_gateway_resource.scenarios_list: Refreshing state... [id=tp2zxu]
module.network.aws_api_gateway_resource.metric_cohort: Refreshing state... [id=fjgqv3]
module.network.aws_api_gateway_resource.company_metric: Refreshing state... [id=2ty0vw]
module.network.aws_api_gateway_resource.comparison_vs_peers_id: Refreshing state... [id=jtuqjb]
module.policy.aws_iam_role_policy_attachment.company_lambda_logs: Refreshing state... [id=demo_company_lambda_exec_role-20211104145749000100000002]
module.policy.aws_iam_role_policy_attachment.company_lambda_vpc: Refreshing state... [id=demo_company_lambda_exec_role-20211104145749000900000003]
module.sql.aws_db_instance.kpinetwork_db: Refreshing state... [id=demokpinetworkdb]
module.functions.aws_lambda_layer_version.db_lambda_layer: Refreshing state... [id=arn:aws:lambda:us-west-2:435552912911:layer:demo_db_lambda_layer:8]
module.network.aws_api_gateway_resource.cohort_scenarios: Refreshing state... [id=63z04b]
module.network.aws_api_gateway_resource.company_permissions: Refreshing state... [id=28s2ly]
module.functions.aws_lambda_function.glue_trigger_lambda_function: Refreshing state... [id=demo_glue_trigger_lambda_function]
module.dns.aws_route53_record.cert_validations[0]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.dns.aws_route53_record.cert_validations[1]: Refreshing state... [id=Z02521762FZPW0IDM8JJO__24e3048f36be454712f534258ba1d3c2.api.demo.kpinetwork.com._CNAME]
module.network.aws_api_gateway_resource.scenarios_company_id: Refreshing state... [id=znsrwp]
module.network.aws_api_gateway_resource.metric_cohort_id: Refreshing state... [id=rr716m]
module.network.aws_api_gateway_resource.metric: Refreshing state... [id=k9hbzo]
module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function: Refreshing state... [id=demo_add_user_to_customer_group_lambda_function]
module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function: Refreshing state... [id=demo_verify_users_with_same_email_lambda_function]
module.network.aws_api_gateway_resource.cohort_metrics: Refreshing state... [id=rtzpd4]
module.network.aws_api_gateway_resource.cohort_average_metric: Refreshing state... [id=hdyvp6]
module.network.aws_api_gateway_resource.average_metrics: Refreshing state... [id=ww2zcl]
module.functions.aws_lambda_function.get_cohorts_scenarios_function: Refreshing state... [id=demo_get_cohort_scenarios_lambda_function]
module.codebuild.aws_codebuild_project.rds_migrations: Refreshing state... [id=arn:aws:codebuild:us-west-2:435552912911:project/demo_rds_migrations]
module.functions.aws_lambda_function.get_average_metrics_function: Refreshing state... [id=demo_get_average_metrics_lambda_function]
module.functions.aws_lambda_function.get_metric_by_company_id_function: Refreshing state... [id=demo_get_metric_by_company_id_lambda_function]
module.functions.aws_lambda_function.get_average_metrics_by_cohort_function: Refreshing state... [id=demo_get_average_metrics_by_cohort_lambda_function]
module.functions.aws_lambda_function.get_cohorts_function: Refreshing state... [id=demo_get_cohorts_lambda_function]
module.functions.aws_lambda_function.get_company_lambda_function: Refreshing state... [id=demo_get_company_lambda_function]
module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function: Refreshing state... [id=demo_get_company_report_vs_peers_lambda_function]
module.functions.aws_lambda_function.get_scenarios_lambda_function: Refreshing state... [id=demo_get_scenarios_lambda_function]
module.functions.aws_lambda_function.get_metrics_function: Refreshing state... [id=demo_get_metrics_lambda_function]
module.functions.aws_lambda_function.get_universe_overview_lambda_function: Refreshing state... [id=demo_get_universe_overview_lambda_function]
module.functions.aws_lambda_function.get_revenue_sum_by_company_lambda_function: Refreshing state... [id=demo_get_revenue_sum_by_company_lambda_function]
module.functions.aws_lambda_function.get_company_scenarios_lambda_function: Refreshing state... [id=demo_get_company_scenarios_lambda_function]
module.functions.aws_lambda_function.change_company_publicly_lambda_function: Refreshing state... [id=demo_change_company_publicly_lambda_function]
module.functions.aws_lambda_function.get_all_companies_lambda_function: Refreshing state... [id=demo_get_all_companies_lambda_function]
module.functions.aws_lambda_function.get_cohort_by_id_function: Refreshing state... [id=demo_get_cohort_by_id_lambda_function]
module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function: Refreshing state... [id=demo_get_comparison_vs_peers_lambda_function]
module.functions.aws_lambda_function.list_scenarios_lambda_function: Refreshing state... [id=demo_list_scenarios_lambda_function]
module.functions.aws_lambda_function.get_revenue_sum_by_cohort_lambda_function: Refreshing state... [id=demo_get_revenue_sum_by_cohort_lambda_function]
module.functions.aws_lambda_function.get_metrics_by_cohort_id_function: Refreshing state... [id=demo_get_metrics_by_cohort_id_lambda_function]
module.functions.aws_lambda_permission.glue_trigger_event_permission: Refreshing state... [id=AllowExecutionFromS3Bucket]
module.cognito.aws_cognito_user_pool.pool: Refreshing state... [id=us-west-2_usXw4S12D]
module.cert.aws_acm_certificate_validation.cert: Refreshing state... [id=2021-10-15 14:52:46 +0000 UTC]
module.functions.aws_s3_bucket_notification.files_bucket_notification: Refreshing state... [id=kpinetwork-files]
module.network.aws_api_gateway_domain_name.domain: Refreshing state... [id=api.demo.kpinetwork.com]
module.network.aws_api_gateway_base_path_mapping.domain_mapping: Refreshing state... [id=api.demo.kpinetwork.com/]
module.dns.aws_route53_record.kpinetwork_domain: Refreshing state... [id=Z02521762FZPW0IDM8JJO_api.demo.kpinetwork.com_A]
module.cognito.aws_cognito_user_group.admin: Refreshing state... [id=us-west-2_usXw4S12D/demo_admin_group]
module.cognito.aws_lambda_permission.allow_post_confirmation_from_user_pool: Refreshing state... [id=AllowPostConfirmationFromUserPool]
module.cognito.aws_cognito_user_pool_client.amplify: Refreshing state... [id=3917dpipsnpi2i8uofiovmn2jr]
module.policy.aws_iam_role_policy.authorize_lambda_get_users_and_groups: Refreshing state... [id=demo_get_users_lambda_exec_role:demo_authorize_lambda_get_users_and_groups]
module.policy.aws_iam_policy.add_user_to_customer_group_policy: Refreshing state... [id=arn:aws:iam::435552912911:policy/demo_post_configuration_trigger_policy]
module.cognito.aws_cognito_user_group.customer: Refreshing state... [id=us-west-2_usXw4S12D/demo_customer_group]
module.policy.aws_iam_role_policy.verify_users_with_same_email_lambda_list_users_policy: Refreshing state... [id=demo_verify_users_with_same_email_exec_role:demo_verify_users_with_same_email_lambda_list_users_policy]
module.policy.aws_lambda_permission.allow_pre_signup_from_user_pool: Refreshing state... [id=AllowPreSignUpFromUserPool]
module.functions.aws_lambda_function.get_user_details_lambda_function: Refreshing state... [id=demo_get_user_details_lambda_function]
module.functions.aws_lambda_function.get_company_permissions_lambda_function: Refreshing state... [id=demo_get_company_permissions_lambda_function]
module.functions.aws_lambda_function.assign_company_permissions_lambda_function: Refreshing state... [id=demo_assign_company_permissions_lambda_function]
module.functions.aws_lambda_function.get_roles_lambda_function: Refreshing state... [id=demo_get_roles_lambda_function]
module.functions.aws_lambda_function.get_users_lambda_function: Refreshing state... [id=demo_get_users_lambda_function]
module.policy.aws_iam_role_policy.get_roles_cognito_policy: Refreshing state... [id=demo_get_roles_lambda_exec_role:demo_get_roles_cognito_policy]
module.policy.aws_iam_role_policy.get_user_details_cognito_policy: Refreshing state... [id=demo_get_user_details_lambda_exec_role:demo_get_user_details_cognito_policy]
module.functions.aws_lambda_function.authorize_lambda_function: Refreshing state... [id=demo_authorize_lambda_function]
module.policy.aws_iam_role_policy_attachment.add_user_to_customer_group_lambda_cognito_policy: Refreshing state... [id=demo_add_user_to_customer_group_lambda_exec_role-20220107163139048600000001]
module.network.aws_api_gateway_authorizer.kpi_authorizer: Refreshing state... [id=3y14fs]
module.network.aws_api_gateway_method.get_cohort_by_id_method: Refreshing state... [id=agm-kb7gblbu69-5k8zew-GET]
module.network.aws_api_gateway_method.assign_company_permissions_method: Refreshing state... [id=agm-kb7gblbu69-28s2ly-PUT]
module.network.aws_api_gateway_method.get_revenue_sum_by_cohort_method: Refreshing state... [id=agm-kb7gblbu69-pymy9y-GET]
module.network.aws_api_gateway_method.get_cohort_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-63z04b-GET]
module.network.aws_api_gateway_method.get_company_report_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-wycmf0-GET]
module.network.aws_api_gateway_method.get_user_details_method: Refreshing state... [id=agm-kb7gblbu69-zhsk31-GET]
module.network.aws_api_gateway_method.get_average_metrics_method: Refreshing state... [id=agm-kb7gblbu69-ww2zcl-GET]
module.network.aws_api_gateway_method.get_revenue_sum_by_company_method: Refreshing state... [id=agm-kb7gblbu69-cl0jnm-GET]
module.network.aws_api_gateway_method.change_company_publicly_method: Refreshing state... [id=agm-kb7gblbu69-eeb9pt-PUT]
module.network.aws_api_gateway_method.get_users_method: Refreshing state... [id=agm-kb7gblbu69-837cdz-GET]
module.network.aws_api_gateway_method.list_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-tp2zxu-GET]
module.network.aws_api_gateway_method.get_roles_method: Refreshing state... [id=agm-kb7gblbu69-7w2rqf-GET]
module.network.aws_api_gateway_method.get_metric_by_company_id_method: Refreshing state... [id=agm-kb7gblbu69-k9hbzo-GET]
module.network.aws_api_gateway_method.get_metrics_by_cohort_id_method: Refreshing state... [id=agm-kb7gblbu69-rtzpd4-GET]
module.network.aws_api_gateway_method.get_cohorts_method: Refreshing state... [id=agm-kb7gblbu69-97prpe-GET]
module.network.aws_api_gateway_method.get_company_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-znsrwp-GET]
module.network.aws_api_gateway_method.get_metrics_method: Refreshing state... [id=agm-kb7gblbu69-1cyyi4-GET]
module.network.aws_api_gateway_method.get_company_permissions_method: Refreshing state... [id=agm-kb7gblbu69-28s2ly-GET]
module.network.aws_api_gateway_method.get_comparison_vs_peers_method: Refreshing state... [id=agm-kb7gblbu69-jtuqjb-GET]
module.network.aws_api_gateway_method.get_scenarios_method: Refreshing state... [id=agm-kb7gblbu69-ifcpo2-GET]
module.network.aws_api_gateway_method.get_universe_overview_method: Refreshing state... [id=agm-kb7gblbu69-zr5b6w-GET]
module.network.aws_api_gateway_method.get_company_method: Refreshing state... [id=agm-kb7gblbu69-sjvaet-GET]
module.network.aws_api_gateway_method.get_all_companies_method: Refreshing state... [id=agm-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_integration.cohort_scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-63z04b-GET]
module.network.aws_api_gateway_method.get_average_metrics_by_cohort_method: Refreshing state... [id=agm-kb7gblbu69-hdyvp6-GET]
module.network.aws_api_gateway_integration.company_report_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-wycmf0-GET]
module.network.aws_api_gateway_integration.user_details_integration: Refreshing state... [id=agi-kb7gblbu69-zhsk31-GET]
module.network.aws_api_gateway_integration.assign_company_permissions_integration: Refreshing state... [id=agi-kb7gblbu69-28s2ly-PUT]
module.network.aws_api_gateway_integration.users_integration: Refreshing state... [id=agi-kb7gblbu69-837cdz-GET]
module.network.aws_api_gateway_integration.revenue_sum_by_company_integration: Refreshing state... [id=agi-kb7gblbu69-cl0jnm-GET]
module.network.aws_api_gateway_integration.cohort_by_id_integration: Refreshing state... [id=agi-kb7gblbu69-5k8zew-GET]
module.network.aws_api_gateway_integration.revenue_sum_by_cohort_integration: Refreshing state... [id=agi-kb7gblbu69-pymy9y-GET]
module.network.aws_api_gateway_integration.average_metrics_integration: Refreshing state... [id=agi-kb7gblbu69-ww2zcl-GET]
module.network.aws_api_gateway_integration.change_company_publicly_integration: Refreshing state... [id=agi-kb7gblbu69-eeb9pt-PUT]
module.network.aws_api_gateway_integration.scenarios_list_integration: Refreshing state... [id=agi-kb7gblbu69-tp2zxu-GET]
module.network.aws_api_gateway_integration.metrics_by_cohort_id_integration: Refreshing state... [id=agi-kb7gblbu69-rtzpd4-GET]
module.network.aws_api_gateway_integration.metric_by_company_id_integration: Refreshing state... [id=agi-kb7gblbu69-k9hbzo-GET]
module.network.aws_api_gateway_integration.get_roles_integration: Refreshing state... [id=agi-kb7gblbu69-7w2rqf-GET]
module.network.aws_api_gateway_integration.cohorts_integration: Refreshing state... [id=agi-kb7gblbu69-97prpe-GET]
module.network.aws_api_gateway_integration.company_scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-znsrwp-GET]
module.network.aws_api_gateway_integration.comparison_vs_peers_integration: Refreshing state... [id=agi-kb7gblbu69-jtuqjb-GET]
module.network.aws_api_gateway_integration.get_company_permissions_integration: Refreshing state... [id=agi-kb7gblbu69-28s2ly-GET]
module.network.aws_api_gateway_integration.metrics_integration: Refreshing state... [id=agi-kb7gblbu69-1cyyi4-GET]
module.network.aws_api_gateway_integration.scenarios_integration: Refreshing state... [id=agi-kb7gblbu69-ifcpo2-GET]
module.network.aws_api_gateway_integration.universe_overview_integration: Refreshing state... [id=agi-kb7gblbu69-zr5b6w-GET]
module.network.aws_api_gateway_integration.companies_integration: Refreshing state... [id=agi-kb7gblbu69-bnvar7-GET]
module.network.aws_api_gateway_integration.company_integration: Refreshing state... [id=agi-kb7gblbu69-sjvaet-GET]
module.network.aws_api_gateway_integration.cohort_average_metrics_integration: Refreshing state... [id=agi-kb7gblbu69-hdyvp6-GET]
module.policy.aws_lambda_permission.apigw_get_company_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetCompanyScenarios]
module.policy.aws_lambda_permission.apigw_get_average_metrics_by_cohort_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCohortAverage]
module.policy.aws_lambda_permission.apigw_get_company_report_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_get_revenue_sum_by_company_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRevenueSum]
module.policy.aws_lambda_permission.apigw_get_all_companies_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_revenue_sum_by_cohort_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRevenueSum]
module.policy.aws_lambda_permission.apigw_list_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayListScenarios]
module.policy.aws_lambda_permission.apigw_get_cohorts_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_change_company_publicly_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayChangeCompanyPublicly]
module.policy.aws_lambda_permission.apigw_get_roles_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetRoles]
module.policy.aws_lambda_permission.apigw_get_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetScenarios]
module.policy.aws_lambda_permission.apigw_get_users_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetUsers]
module.policy.aws_lambda_permission.apigw_get_average_metrics_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayAverage]
module.policy.aws_lambda_permission.apigw_assign_company_permissions_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_comparison_vs_peers_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_get_metrics_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.policy.aws_lambda_permission.apigw_get_universe_overview_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayRuleOf40]
module.policy.aws_lambda_permission.apigw_get_user_details_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetUserDetails]
module.policy.aws_lambda_permission.apigw_get_metric_by_company_id_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_metrics_by_cohort_id_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCohortId]
module.policy.aws_lambda_permission.apigw_get_cohort_by_id_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_cohort_scenarios_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_company_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayCompanyId]
module.policy.aws_lambda_permission.apigw_get_company_permissions_lambda: Refreshing state... [id=AllowExecutionFromAPIGatewayGetCompanyPermissions]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function has changed
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-02-16T21:48:01.000+0000" -> "2022-02-16T21:56:13.000+0000"
      ~ source_code_hash               = "KNRWCCF3I4Y7aveojwqZwfquSCOv6c/h9zRA2+ageuo=" -> "ToGuxlDkZ21277LnsLb9dntdDVksva6b4E5ZUAtlViU="
      ~ source_code_size               = 6498 -> 6200
        tags                           = {}
        # (23 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "c2a5f1272bfde7011c0c9ec1e41edcb2" -> "f50acf9659479ea183a079491c143d85"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "f36d637d5a652f1b8ae3d518bc3fa39c" -> "9641c2d734c3f5a5838453f0faa8daea"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "205703c7ddacde4d34001b890ced5cad" -> "f9a288a41097e6bc5b31744e2fb5e545"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "e4c5add0153fc9be99ed2259c0b6ae0a" -> "4c76f13810bd0f6dd6b4b54435f87644"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "ddc39ada432c3864278960b47dc759ee" -> "331c6a76395a569f46d799752db3973f"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_average_metrics_by_cohort_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_average_metrics_by_cohort_function_object" {
      ~ etag               = "37a2ddb30bc6d0bb7ec0929c341bbbe4" -> "f748fcf73cd005e2c6c7b4171d0a4774"
        id                 = "lambdas/demo/get_average_metrics_by_cohort_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_average_metrics_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_average_metrics_function_object" {
      ~ etag               = "515440f76c87bd96a004e88699bcea7a" -> "18a22baaf46d8ae06a95e88763d239ae"
        id                 = "lambdas/demo/get_average_metrics_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_cohort_by_id_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_cohort_by_id_function_object" {
      ~ etag               = "62e8431824f2caace975b49d7cacb083" -> "1ff574e416c8799a69922e54c7aeec97"
        id                 = "lambdas/demo/get_cohort_by_id_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_cohort_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_cohort_scenarios_function_object" {
      ~ etag               = "34e3c953e80d8518d30716586d38ed5c" -> "dc6d2dd9f8c5d3558ee2781ed61f1eba"
        id                 = "lambdas/demo/get_cohort_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_cohorts_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_cohorts_function_object" {
      ~ etag               = "d965e762d22e40ae3c7d8b59c67e8bc8" -> "18e347f4130cd672def2ff3870b66b8e"
        id                 = "lambdas/demo/get_cohorts_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_function_object" {
      ~ etag               = "04a87ffdcd05ba1a7a2d1943aa6002de" -> "c94d6360919042303ad46c8619f49075"
        id                 = "lambdas/demo/get_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "55e7ad4f53481ff0186dc4ac95e4d403" -> "32c9522cb0cc2ea6073b9d7b207085af"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "a24d92a9cca4afba576431e0645a7afe" -> "bf813ede9d19246ca43329c56b2a85f5"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_scenarios_function_object" {
      ~ etag               = "b2d3c05172d26a56c88896d90f233d37" -> "aa324b711c660a4fc71f063d0d1927a4"
        id                 = "lambdas/demo/get_company_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "cdf5b12e6074dd18eae125e964d42abd" -> "072b33e7993d76660902861fb8529af1"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_by_company_id_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_by_company_id_function_object" {
      ~ etag               = "8d47f44fd4c7f8f155efa03949015086" -> "a32706b7f098f85204dbc363dc634b53"
        id                 = "lambdas/demo/get_metric_by_company_id_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metrics_by_cohort_id_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metrics_by_cohort_id_function_object" {
      ~ etag               = "e09ba3b5b93e1e9920ae629f6aeb6529" -> "b4e55fc82c1cdcb54588fe820c8baffa"
        id                 = "lambdas/demo/get_metrics_by_cohort_id_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metrics_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metrics_function_object" {
      ~ etag               = "095d2643a48253dc5606eb58965ba77a" -> "3358043d65b6fb35e086dfb8983e54e4"
        id                 = "lambdas/demo/get_metrics_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_revenue_sum_by_cohort_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_revenue_sum_by_cohort_function_object" {
      ~ etag               = "3adc2753952c1f6bddc2fda94373184e" -> "c4990c4b280ada68482e5eaea396f9f7"
        id                 = "lambdas/demo/get_revenue_sum_by_cohort_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_revenue_sum_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_revenue_sum_by_company_function_object" {
      ~ etag               = "daaf9acb867b3ffdaeac605c3a69b206" -> "b043f6b0525dcca170ff9b54009a9fc4"
        id                 = "lambdas/demo/get_revenue_sum_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "8dc343ee2da17becacbac2cc84679e57" -> "882e479da8b96e79ee11a79002187a23"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_scenarios_function_object" {
      ~ etag               = "b61b322e775f58b26d0dc1984ef37856" -> "02eec5d42f2d432a06deaaabef75bdb7"
        id                 = "lambdas/demo/get_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "17efc762180dfbc63afef23ff5a2abba" -> "e14100ed978fd746ac4d1f06ca9f2c0b"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "9b3ca704388a5f0983f72d9de5978642" -> "2b55590a45ae19732c2b7e13736a8762"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "7419d6fae5f39763a716098fd6b7736e" -> "9a92d470e6a35ce4276f778cb42f1184"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "1b91bdae6ff2e6bcc52b5b43ff6252f1" -> "9a47274cf6cd7d5f8a42e8e4b5f5b16f"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "cfff291b40d959effd948e633c848f5c" -> "daa356a819f7bc4b7ac6f6b2c1e054a5"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.list_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "list_scenarios_function_object" {
      ~ etag               = "873e2704cf48912c7d627a344d95ed08" -> "9c7b3b437e8c7749b073f167d05c4157"
        id                 = "lambdas/demo/list_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "a718eb31e93714143761433d1d0ea3b6" -> "8f7f5d58c797e93e30f24b2ab3aec134"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-02-16T21:48:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "pqnqkugpMp1Y11KQkSEteMESU15BsCvja9nwoj7EP6g=" -> "417kl6589deFNKZtxUuM6rzArfwBDDU4cjYUkUXoxYQ="
        tags                           = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-02-16T21:48:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "GIUN2PtxpL8D/kSyxtLqTtYPKPJHuk6VT7F8Nf1sw2w=" -> "/r48ikHSwedRUg6wckBOwOy6iVCmZtnQEVXDWpaCyHU="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-02-16T21:47:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "iSl8snquGgpkj3vV/zVsxyfGof1mArdFbNxe4/wyEks=" -> "qlWo1E9k3tKkWc/elGIuIUKazCfjlg6730fgiT0tYPU="
        tags                           = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-02-16T21:48:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "PFhDVXqSrTSOCNQUuHqWsFPNtAmyG+wLzZmmwKZhAOI=" -> "OrNTs00K5ZlxGOPKD5vHTrfKQFxWb5u8koiB2edVucc="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-02-16T21:48:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "uKjdUscf/VMX/UF9RmEMWtFS9BnJjxXOxLn3Lp+y+8o=" -> "ughizs7qhfq2IU0NTmuGpk6/dHKfNhBQ4I7y2syv1RU="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_average_metrics_by_cohort_function will be updated in-place
  ~ resource "aws_lambda_function" "get_average_metrics_by_cohort_function" {
        id                             = "demo_get_average_metrics_by_cohort_lambda_function"
      ~ last_modified                  = "2022-02-16T21:47:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "lkbUFR1rGHFDeJNgb1cBeAC/f/gzOJ7E8bEoAhWEtAw=" -> "YhAai13ETJqDyGTFiODr1o6y9CBv2rJp63dsM318z0w="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_average_metrics_function will be updated in-place
  ~ resource "aws_lambda_function" "get_average_metrics_function" {
        id                             = "demo_get_average_metrics_lambda_function"
      ~ last_modified                  = "2022-02-16T21:47:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "jUJN2ona/3n4tSDo6gYURIPEIGsd0V8N4gGLL0y/rTw=" -> "GbFxljpYJ3DTE2F7Z+0Pv0NXJ5wlVokyH5XfgYG1Kng="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_cohort_by_id_function will be updated in-place
  ~ resource "aws_lambda_function" "get_cohort_by_id_function" {
        id                             = "demo_get_cohort_by_id_lambda_function"
      ~ last_modified                  = "2022-02-16T21:48:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "883CFIJ0c8bGnAnBzk04mFo9FDGb7IXv97wdpQ/6uIE=" -> "/OTH5mar8bj6OCsUCKRGmhsXWfrKm2TTwZpr1jf6WSE="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_cohorts_function will be updated in-place
  ~ resource "aws_lambda_function" "get_cohorts_function" {
        id                             = "demo_get_cohorts_lambda_function"
      ~ last_modified                  = "2022-02-16T21:48:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "DQs0uu1qUxmohGXtUTByYnya+qXfx4zV/Swy706sRjw=" -> "NV46uHm593JTFqUWF26ysnpylY++T+NsZj2WGOsrqBk="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_cohorts_scenarios_function will be updated in-place
  ~ resource "aws_lambda_function" "get_cohorts_scenarios_function" {
        id                             = "demo_get_cohort_scenarios_lambda_function"
      ~ last_modified                  = "2022-02-16T21:48:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "/4vTD/lNrf9ElgPDshYtkwS5lxQwHXBMJBqfBGmY1iY=" -> "y9SUkU5NobG1QvgNiN6PJF6y9SvTjjMUxWSstfWkbv8="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_lambda_function" {
        id                             = "demo_get_company_lambda_function"
      ~ last_modified                  = "2022-02-16T21:48:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "kHKzHtdgPOWoPESK0kiI6+50AA6KlZ4zEsoxho/wfJI=" -> "mYo2zcni08S5nSxhxGgKK3A3HgquQGmAWbXDkWVguGE="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-02-16T21:48:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "Hjf8yPQf1P1NkB6p8UoVnD5hz+L+MvoDT60ifSvjNkQ=" -> "aOZhrvPwj7YyvKQr0Dyj6vQEMwjNa046dMMp6ttdk7Y="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-02-16T21:56:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "ToGuxlDkZ21277LnsLb9dntdDVksva6b4E5ZUAtlViU=" -> "8e8pxWDyEqLTVX02e5+cFmSGDHOAJmhREu2w/vslJBw="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_scenarios_lambda_function" {
        id                             = "demo_get_company_scenarios_lambda_function"
      ~ last_modified                  = "2022-02-16T21:48:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "bRaW7O069uEVo93EYD0h0mj6FKan07sSFj+zK6d/2+k=" -> "L/+YcScfnGXd5UzNvG8JCQbe+udD/OTsTD/PhY8eFsc="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-02-16T21:48:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "4qM0RwpqyrPKL0kCJrm2zWyYzFb9mlN1O//iyJSB5jA=" -> "tAEEkKni8XXnGHZnjxxPCxOaWozIOsjRRsksT9Esjbg="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_by_company_id_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_by_company_id_function" {
        id                             = "demo_get_metric_by_company_id_lambda_function"
      ~ last_modified                  = "2022-02-16T21:47:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "CRj/qqLvLkVZfyl7nZ+UC4yR3702lnhjTGe4Tu0bJqY=" -> "2M46j4Cn8OLJONpgA7MGJYv5cdXeyTGO4HNRtMl8cSM="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metrics_by_cohort_id_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metrics_by_cohort_id_function" {
        id                             = "demo_get_metrics_by_cohort_id_lambda_function"
      ~ last_modified                  = "2022-02-16T21:48:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "9STyzooOrvefdK3xeRbxpOPAdncdlfOca0EZMB+YxwU=" -> "5g+YperKPrynlCIDEFx9k/221+LIptrSLLiJ34WvwpY="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metrics_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metrics_function" {
        id                             = "demo_get_metrics_lambda_function"
      ~ last_modified                  = "2022-02-16T21:47:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "vEhkGQst3W03oABoZ+1iK20okpmrofXr/gIw9b8d8lg=" -> "G9EfHJepveMK02bBbApVhxPstu2fRd8mcdSbaMsMkzc="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_revenue_sum_by_cohort_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_revenue_sum_by_cohort_lambda_function" {
        id                             = "demo_get_revenue_sum_by_cohort_lambda_function"
      ~ last_modified                  = "2022-02-16T21:48:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "Kd9FSiHgIKzZPBEMKj0fBd1S6PghVfW4a+bH0GVI2PA=" -> "ko4LKXRpYZNSkqohQwoeFyANzhRPWFULu0aD+Z7QeEg="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_revenue_sum_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_revenue_sum_by_company_lambda_function" {
        id                             = "demo_get_revenue_sum_by_company_lambda_function"
      ~ last_modified                  = "2022-02-16T21:47:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "7EZ8Gsa+Op4iyRjIpP8npG4EK0StN0z8Kre3gYP38Jg=" -> "bdJmJz+DYOtGwSTkJOQQspIDHI587fL4fOyk65EdVy0="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-02-16T21:47:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "l3lE5pVg6mC5ojSeGnoD7j6G8tszsImtDBojP/339+c=" -> "RE3AOCoOsSicFjQ9MFWtf8J+nBK/swegWEWIWTKLvqY="
        tags                           = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_scenarios_lambda_function" {
        id                             = "demo_get_scenarios_lambda_function"
      ~ last_modified                  = "2022-02-16T21:47:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "TMDLb9Q2gdCP9JbGgz13ysKNAGSv2ct4LCuGokGgnms=" -> "7cpNwmuSzaGsu/LywJ3ui6qouaSaZHuNbc9Browpebw="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-02-16T21:48:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "/MQTksQL5u47h6aawpJbNMu8QJLfU3auPUWTBkR74xo=" -> "m06ow8bkIDyJHZNRJz0fVJ04OUqE8jjontrj/isnt/M="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-02-16T21:47:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "hepEl/yGuCXOIDzBvIQNWnbU8wIwoDp6ib79F2NP7K0=" -> "I5FyXQuuxIBrS2j84HLibbV5KCniL4Odp/j+OkQdyDs="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-02-16T21:48:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "6xD8UTf7JuJEya3UPpRqgSN2Ukrvj6i9B/zxvm3IUIA=" -> "rJdyqis0xyu63WQacIE/QattqCGpw4uVWOa+ja3U8qg="
        tags                           = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-02-16T21:47:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "0YNrF0sYgknVpHThBlsrE/ainUdCKao17GfK5c+1lnE=" -> "akNTpqTESPLv2wq9IUGkREX2QPYBRyaI9JcKEUSJBok="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.list_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "list_scenarios_lambda_function" {
        id                             = "demo_list_scenarios_lambda_function"
      ~ last_modified                  = "2022-02-16T21:47:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "Mu62I5Gw0f6uearkcn9s/5rH8flU9ztK/KM3fp113mA=" -> "122F3ID9u6KQ3M0Wh3lHCafLt39b5X1bgjMxDEDE4jY="
        tags                           = {}
        # (24 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-02-16T21:48:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "1te0DPodshp2XbKtgtxA4eT7EyEyD8R91SEXEDK8gPA=" -> "ersy9l3INfUuaI5BtiFKAtiGhY1As7WR4IO1tIzzI3s="
        tags                           = {}
        # (24 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-02-16T21:47:22Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "vdz4b2" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-02-16T21:47:21Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 57 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kellycastrof, Action: `pull_request`*